{
  "entries": [
    {
      "dream": "Mira wanders into a hall where Solen auctions fragments of constellations. Ludo deals glowing cards as currency, while Thatch hops across the rafters shouting bids. Jessa offers jars of bees as collateral, and Hesh lingers in the back, swallowing starlight like smoke.",
      "entities": [
        "Mira",
        "Solen",
        "Ludo",
        "Thatch",
        "Jessa",
        "Hesh"
      ]
    },
    {
      "dream": "A ship made of mirrors drifts, captained by Orra. Riven repairs cracks in the hull with molten light, while Finch oils the rigging. Mira peers into the ocean and sees Arlo walking calmly along the seabed, holding hands with Selra, who dances despite the water. In the crow’s nest: Thatch.",
      "entities": [
        "Orra",
        "Riven",
        "Finch",
        "Mira",
        "Arlo",
        "Selra",
        "Thatch"
      ]
    },
    {
      "dream": "Moss tends a field where winter blooms in summer soil. Yara plays her violin, and each note flips a patch of the garden from frost to fire. Dr. Kelm scribbles in a notebook, fascinated. Arlo runs through the shifting fields, chased by Hesh, who leaves behind withering footprints.",
      "entities": [
        "Moss",
        "Yara",
        "Kelm",
        "Arlo",
        "Hesh"
      ]
    },
    {
      "dream": "Daro leads Mira down corridors where books whisper. Selra dances between shelves, knocking volumes into Jessa’s honey-laden basket. Orra consults a map that redraws itself, while Solen debates with the books about which truths are lies. In the highest gallery, Riven builds a stained-glass window to trap a page of sunlight.",
      "entities": [
        "Daro",
        "Mira",
        "Selra",
        "Jessa",
        "Orra",
        "Solen",
        "Riven"
      ]
    },
    {
      "dream": "A ferris wheel spins without sound. Finch and Ludo run the rides, though the seats are empty. Yara plays music that no one claps for. Mira sees Moss juggling seeds that grow into trees before vanishing. Daro narrates the carnival over a loudspeaker, while Hesh replaces the shadows of every guest with his own.",
      "entities": [
        "Finch",
        "Ludo",
        "Yara",
        "Mira",
        "Moss",
        "Daro",
        "Hesh"
      ]
    }
  ]
}